[{"title":"Apeak Corporation","content":"# Apeak Corporation\n\n[[Symlink]]\n\n## Backlinks\n* [[Won's notes]]\n\t* Hi, I am Won. I am a husband of a beautiful wife, father of two lovely children, avid hiker and camper, life-long learner who must try anything that interests me, senior software engineer at [[Microsoft]], and co-founder and software engineer at [[Apeak Corporation]]. \n\n\n\n\n"},{"title":"Azure B2C","content":"# Azure B2C\n\n\n\n\n\n\n"},{"title":"Azure Kubernetes Service","content":"# Azure Kubernetes Service\n\n\n\n\n\n\n"},{"title":"Azure Workload Identity","content":"# Azure Workload Identity\n* `azure.workload.identity/use` label\n\n\n\n\n\n\n"},{"title":"Cost in life","content":"# Cost in life\nCost in monetary value does not show the full picture because money can only be earned in exchange for my hours. It's a better idea to see costs in life to reveal it's true cost and value\n\n\n\n\n\n\n\n"},{"title":"Data ingestion","content":"# Data ingestion\n\n\n\n\n\n\n"},{"title":"How to link local NPM library to another local project","content":"# How to link local NPM library to another local project\n1. Link the project (i.e. `yarn link` or `npm link`. This will [[Symlink]] the project to the current node version’s global node_modules folder\n\t* If you use NVM, need to ensure the both projects are on the same node version, otherwise the symlink won’t work\n2. \n\n\n\n\n\n"},{"title":"Intentional life","content":"# Intentional life\n* My usage of cell phone affects how I live my life. Instead of having an intention, it makes me pass time doing nothing meaningful\n* Cell phone is a slot machine - apps and device engineered to keep checking\n* There should be time for leisure but the point is that the leisure time come with intention to take break instead of being forced by cell phone notifications\n\n\n\n\n\n\n\n"},{"title":"KEDA (Kubenetes Event-Driven Autoscaling)","content":"# KEDA (Kubenetes Event-Driven Autoscaling)\n\n\n\n\n\n\n\n"},{"title":"Microsoft","content":"# Microsoft\n\n\n## Backlinks\n* [[Won's notes]]\n\t* Hi, I am Won. I am a husband of a beautiful wife, father of two lovely children, avid hiker and camper, life-long learner who must try anything that interests me, senior software engineer at [[Microsoft]], and co-founder and software engineer at [[Apeak Corporation]]. \n\n\n\n\n"},{"title":"Parenting","content":"# Parenting\n\n\n\n## Backlinks\n* [[Won's notes]]\n\t* [[Parenting]]\n\n\n\n\n"},{"title":"Real self-esteem is letting go of self-doubt","content":"# Real self-esteem is letting go of self-doubt\nWhen I start thinking about myself in terms of how I compare to other people or how I would look to other people, I can no longer enjoy or concentrate on the moment. I will start feeling bad and start thinking about what I would have to do to improve my skills or appearances. It doesn’t matter what others would tell me about my skills. I will continue to feel bad until I can convince myself - which most likely won’t happen if I am in fact inferior in certain ways.\n\n[[Strategies for boosting self-esteem should not involve increased self-focus]]. Instead, it should guide kids with low self-esteem to focus on the present moment instead.\n\n---\n* Kid Confidence, Kennedy-Moore\n> The key to breaking free from low self-esteem is to move beyond self-focus. Real self-esteem isn’t about believing we are special or wonderful. Real self-esteem means being able to let go of the question, “Am I good enough?”.\n> Real self-esteem involves developing fully engaged presence in what we are doing right now. When we’re not mentally standing back and judging ourselves, we are free to listen, and learn, and try, and experience, and do, and care.\n\n\n\n\n\n\n"},{"title":"Strategies for boosting self-esteem should not involve increased self-focus","content":"# Strategies for boosting self-esteem should not involve increased self-focus\nRepeating positive things and focusing on experiencing success can backfire for kids with low self-esteem because they encourages them to evaluate themselves.\n\n\n---\n* Kid Confidence, Kennedy-Moore\n> Saying very positive things to themselves can make kids with low self-esteem feel bad about themselves, because they become acutely aware of how much they don’t measure up to the positive statement.\n> People with low self-esteem feel more anxious after a victory than a defeat. They expected the defeat but the victory seems surprising and dangerous.\n\n\n\n## Backlinks\n* [[Real self-esteem is letting go of self-doubt]]\n\t* [[Strategies for boosting self-esteem should not involve increased self-focus]]. Instead, it should guide kids with low self-esteem to focus on the present moment instead.\n\n\n\n\n"},{"title":"Symlink","content":"# Symlink\nA file whose purpose is to point to another file or location. Think of shortcut file in Windows. \n\n\n\n## Backlinks\n* [[Apeak Corporation]]\n\t* [[Symlink]]\n* [[How to link local NPM library to another local project]]\n\t* Link the project (i.e. `yarn link` or `npm link`. This will [[Symlink]] the project to the current node version’s global node_modules folder\n\n\n\n\n"},{"title":"Use standard deviation instead of average for performance reporting","content":"# Use standard deviation instead of average for performance reporting\nAverage does not provide a full picture of the performance of an application. On the other hand, [[Standard deviation]] can provide more details including the range of dataset and provide useful insights on number of users experiencing the performance. \n\nFor example, an average of 1 second cannot clearly tell what 50% of the users are experiencing. However, 1 second of 50th percentile can clearly tell that 50% of the people would experience 1 second performance. \n\n\n\n\n\n\n\n"},{"title":"Won's notes","content":"# Won's notes\n![](../assets/0.webp)\n\nHi, I am Won. I am a husband of a beautiful wife, father of two lovely children, avid hiker and camper, life-long learner who must try anything that interests me, senior software engineer at [[Microsoft]], and co-founder and software engineer at [[Apeak Corporation]]. \n\nThis site is my learning experiment inspired by Andy Matsutak's evergreen notes and his way of using notes as tool for effective thinking. I am publishing these notes to create some pressure for myself to write quality notes. \n\nHere are some of my interests:\n\n* [[Parenting]]\n\n\n\n\n\n"},{"title":"Workers that relies on data and creativity are easier to be replaced by Artificial Intelligence than physical workers","content":"# Workers that relies on data and creativity are easier to be replaced by Artificial Intelligence than physical workers\nI came across an interview by the author of Sapiens, Yuval Noah Harari, where he mentioned that the creative workers are more likely to be replaced by AI than physical workers.  There is some truth to it and the recent development of ChatGPT and the AI that draws images based on text input shows that the creative workers are not safe from AI.\n\n## How will programmers be affected by AI?\nSeeing how ChatGTP generates text contents like email could make programmers scared. However, there is a huge difference when it comes to the output that programmers create and writers and artists create. It's okay for content writers to have a typo and artists to have a wrong stroke of a brush. It still does not completely ruin the final outcome. However, in case of a software, a single mistake can exposes security holes and generate wrong outputs. Also, there are typically lots of moving parts in a hyper-scale software and not everything can be done using just text contents. \n\nGithub Copilot has been great as it quickly completes my code but it's still my job to ensure that it works correctly. The AI might make code completion more relevant and correct but one cannot be sure that it will work as expected without testing and debugging. \n\n\n\n\n\n\n\n"}]